/*

    0  1   2  3  4  5  6
1. arr = {1, 0, -6, 2, 5, 3, 2}
2. arr[6] = pivot (Берем в качетсве опоры последний элемент массива (значение 2 под индексом 6))
3. Разделяем массив на числа меньше чем 2 и больше чем 2. Получится {1, 0, -6, 2, 2(pivot), 5, 3}
4 Повторяем шаги 1-3 для правого подмассива от pivot и левого подмассива от pivot 
Рассматриввем правый массив
1. {1, 0, -6, 2}
Берем опорный элемент 2
Делим массив на тех числа что меньше 2 слева и те что больше 2 справа
остается {1, 0, -6}
Далее берем опрным элементов -6
Делим массив на те числа что меньше -6 и те что больше -6 справа
И так далее
*/

using static Sorting;

int size = 10;
var arr = size.CreateArray()
            .Print()
            .SortQuick(0, size - 1)
            .Print();
